src/main/java/org/immregistries/smm/tester/connectors/MAworks.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:cdc:iisb:2011">
   <soap:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-100" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>ccghlsevenqa</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Cgmiis801</wsse:Password>
              </wsse:UsernameToken>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
      <urn:submitSingleMessage>
         <urn:facilityID>10144</urn:facilityID>               
         <urn:hl7Message><![CDATA[MSH|^~\&|EHR|10144|MIIS|99990|20190809||VXU^V04^VXU_V04|23ds124assqqw1234s5|T|2.5.1|||
PID|1||MRN1234^^^AssigningAuthority^MR||lastName^firstName^middle^suffix^^^L~aliasLast^alianFirst^^^^^A|Mothersname|20000101|M||2106-3^White^HL70005|101 Main Street^Apt 222^Boston^MA^02108^^P~16 Main Street^Apt1^Boston^MA^123455678^^M~8 Merrill Road^Apt1^Hull^MA^02495^^V||617-282-7091^PRS~6172223457^PRN~1231231234^WPN^^email@gmail.com|||||||||2135-2|
PD1|||Sample Family Practice^^10144|NPI001^PCPLastname^PCPFirstname|||||||01^No reminder or recall|N||||A|
NK1|1|Momlastname^Momfirstname^middleName^JR^^^L|MTH^Mother^HL70063|5 Elm Street^dfga^Boston^MA^02108^^P|617-282-7091^PRS~6172223457^PRN~1231231234^WPN^^email@gmail.com|||||||||||||||||01^No remainder recall^HL70215
PV1|1|R||||||||||||||||||V01
IN1|1||8|Aetna Inc
ORC|RE||4242546^ImmuGiven By||||||||||||||
RXA|0|1|20150101|20150101|08^Hep B Peds^CVX^58160-0820-52^HepB^NDC|0.5|ML||00^New Immunization Record^HL7|NPI001^Nurseln^Nursefn^^^^CNP^^|||||2372K|20200920|GSK^Glaxo Smith Kline^HL70227|||CP||20150701041038
RXR|IM^ID^NCIT|LT^Left Thigh^HL70163
OBX|1|CE|30956-7^Single Vaccine Type^LN|1|43^HepB Adult^CVX||||||F|||20150120101310
OBX|2|CE|30963-3^Vaccine Funding Source^LN|1|VXC1^FEDERAL^CDCPHINVS||||||F|||20150120101310
OBX|3|TS|29768-9^Date Vaccine Information Statement Published^LN|1|20140102||||||F|||20150120101310
OBX|4|TS|29769-7^Date Vaccine Information Statement Presented^LN|1|20000105||||||F|||20150120101310
OBX|5|CE|64994-7^Test^|1|V01^^||||||F|||]]>

</urn:hl7Message>
      </urn:submitSingleMessage>
   </soap:Body>
</soap:Envelope>
