hit-iz-service/src/test/resources/soap/invalidSubmitSingleMessage.xml

<?xml version='1.0' encoding='UTF-8'?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
   <Header />
   <Body>
      <submitSingleMessage xmlns="urn:cdc:iisb:2011">
         <usernameX></usernameX>
         <passwordX></passwordX>
         <facilityIDX></facilityIDX>
         <hl7MessageX></hl7MessageX>
      </submitSingleMessage>
   </Body>
</Envelope>
